export const typeLines = {
    ru: [
        'развиваемся, приносим пользу, вызываем',
        'интерес, делаем интернет красивее,',
        'дизайн вызывающий эмоции, работаем,',
        'кайфуем, творим, достигаем, развиваемся,',
        'приносим пользу, вызываем интерес,',
        'делаем интернет красивее, дизайн',
        'вызывающий эмоции, работаем, кайфуем,',
        'творим, пользу, вызываем интерес, делаем',
        'интернет красивее, дизайн вызывающий',
        'интернет красивее, дизайн вызывающий',
        'эмоции, работаем, кайфуем, творим,',
        'достигаем, развиваемся, приносим пользу,',
        'вызываем интерес, делаем интернет',
        'красивее, дизайн вызывающий эмоции,',
        'могём, хотим'
    ],
    en: [

    ]
}