import React from 'react';

function CareClients(props) {
    return (
        <div className="foryou max-w-screen-xl mx-auto pl-6 2xl:pl-0 pr-4 2xl:pr-0 pt-4 2xl:pt-24 2xl:pb-56 flex justify-end font-grotesk">
            <div className="w-full 2xl:w-11/12 grid gap-y-4 2xl:gap-y-24">
                <h2 className="text-[15px] 2xl:text-6xl 2xl:leading-[5.5rem] text-white opacity-90">
                    Забота о клиенте
                </h2>
                <div className="foryou-grid grid 2xl:grid-cols-2">
                    <div className="">
                        <div className="w-full 2xl:w-[85%] text-[11px] 2xl:text-2xl 2xl:leading-9 text-white opacity-90 font-light">
                            Уважая ваше время, для тех кому нужны нюансы ниже сделали сноски, кому
                            это пока не интересно удобно проскролить 1 экран)
                        </div>
                        <div className="foryou-nav mt-6 flex flex-wrap gap-x-2.5 2xl:gap-x-4 gap-y-3 2xl:gap-y-5 text-[6.5px] 2xl:text-xs text-grey-mapbiz">
                            <a
                                href="#"
                                ffcoder-foryou-el={1}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Начало
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={2}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Оформление
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={3}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Процесс
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={4}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Стоимость
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={5}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Гарантии
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={6}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Отчетность
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={7}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Оплата
                            </a>
                            <a
                                href="#"
                                ffcoder-foryou-el={8}
                                className="foryou-nav__el px-2.5 leading-[0.5rem] 2xl:px-4 py-[0.3rem] 2xl:py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                            >
                                Результат
                            </a>
                        </div>
                    </div>
                    <div className="foryou-toggle pt-4 2xl:pt-0 flex justify-end h-[265px] 2xl:h-[530px]">
                        <div
                            className="foryou-toggle__base w-full 2xl:w-[90%] h-full bg-center bg-cover bg-no-repeat"
                            style={{
                                backgroundImage: "url(assets/images/home/home-foryou.jpeg)"
                            }}
                        />
                        <div className="foryou-toggle__active w-full 2xl:w-[90%] h-full hidden bg-center bg-cover bg-no-repeat relative">
                            <img
                                className="w-full h-full absolute left-0 top-0"
                                src="assets/images/home/home-foryou-fone.png"
                                alt=""
                            />
                            <div className="foryou-toggle__close absolute top-6 right-6 cursor-pointer z-20">
                                <svg
                                    className="w-4 2xl:w-8 h-4 2xl:h-8"
                                    width={30}
                                    height={30}
                                    viewBox="0 0 30 30"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M14.3226 17.9674C11.7133 20.3402 9.16172 22.6385 6.63565 24.9654C5.17224 26.3134 3.76123 27.7199 2.30123 29.0716C1.91237 29.4408 1.46552 29.7409 0.979126 29.9595C0.739275 30.0618 0.221335 29.9595 0.103217 29.7722C-0.0530674 29.5234 -0.00686019 29.082 0.0779113 28.7574C0.139582 28.5207 0.390682 28.3248 0.580112 28.1348C4.18256 24.5318 7.78667 20.9312 11.3923 17.3329C11.7969 16.9293 12.2131 16.538 12.6779 16.0898C11.1022 14.316 9.52409 12.6043 8.01749 10.829C5.61295 7.99437 3.25666 5.11755 0.880452 2.25835C0.794073 2.15444 0.71977 2.04071 0.632588 1.9368C0.216766 1.43749 -0.0763915 0.899327 0.397083 0.293654C0.751637 -0.159833 1.59922 -0.0921009 2.18941 0.524822C3.65925 2.06079 5.09106 3.63397 6.51089 5.21923C9.10345 8.11218 11.6758 11.024 14.2591 13.9255C14.3697 14.031 14.4873 14.1287 14.611 14.2178C16.6086 12.2784 18.584 10.3454 20.5759 8.42901C22.8861 6.2076 25.2043 3.99493 27.5306 1.79097C28.4033 0.962547 29.103 0.813227 29.6385 1.29658C30.1935 1.79732 30.1418 2.6339 29.2568 3.53085C26.8639 5.9562 24.4132 8.32265 21.9648 10.6917C20.0997 12.4971 18.2047 14.2714 16.2196 16.1571C17.8327 17.8518 19.3755 19.541 20.993 21.152C22.5466 22.6994 24.187 24.1571 25.7712 25.6726C26.3905 26.2429 26.9704 26.856 27.5069 27.5076C27.9396 28.0543 28.0035 28.733 27.4716 29.2722C26.9475 29.8041 26.3406 29.6161 25.835 29.2136C24.8679 28.4836 23.9408 27.7001 23.058 26.8667C20.3556 24.1783 17.7008 21.4406 15.0287 18.7207C14.8174 18.506 14.6154 18.2806 14.3226 17.9674Z"
                                        fill="white"
                                        fillOpacity="0.8"
                                    />
                                </svg>
                            </div>
                            <div className="foryou-els relative z-10 px-4 2xl:px-9 py-4 2xl:py-20 text-white opacity-90 font-grotesk font-light">
                                <div className="foryou-el" ffcoder-foryou-el={1}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Начало общения
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        При обращении к нам мы знакомимся с заказчиком, продуктом и
                                        итоговой целью. Делаем анализ исходных данных и собираем
                                        недостающие данные для составления правильного комплекса
                                        ресурсов. Далее, если имеем экспертизу в вашем вопросе -
                                        предлагаем возможные варианты достижения цели.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={2}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Оформление
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        После того как мы определили объём и нюансы работ, сформировали
                                        техническое задание и сроки выполния - фиксируем все в договоре.
                                        Фиксируем счета и по итогу закрывающие документы.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={3}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Рабочий процесс
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        Обычно делаем рабочую группу WhatsApp, Telegram или другой
                                        удобный заказчику ресурс - туда включаем всех тех, кто будет
                                        учавствовать в работе с вами + продукт менеджер для контроля.
                                        Создаем цифровую доску для отражения процесса и заметок. Общение
                                        в свободном формате с командой ежедневно, онлайн.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={4}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Ценообразование
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        После того как мы определились с объемом работ составляется
                                        график работ и смета рабочих часов специалистов, от которой и
                                        зависит итоговая стоимость разработки, либо другой услуги. Чем
                                        сложнее задаче, тем больше стоимость часа. Чкм объяемней работа,
                                        тем больше рабочих часов нужно. Все справедливо.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={5}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Гарантии
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        Мы документально берем на себя ответственность за сроки,
                                        качество и функционал. В случае разработки - утверждаем дизайн
                                        проект. В случае рекламы или продвижения - фиксируем задачи и
                                        план работ - ему следуем, отчитываемся и обнажаем проблемные
                                        моменты. Гарантий в виде количества обращений в месяц не даем -
                                        не мошенники.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={6}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Отчетность
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        В ходе сотрудничества мы предоставляем переодическую отчетность
                                        о проделанной работе, трудностях и успехах. Переодичность и
                                        форма зависит от типа и нюансов работ. Помимо этого, всегда с
                                        вами на связи ваш продукт менеджер, который является неким
                                        “переводчиком на человеческий язык” происходящего.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={7}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Оплата
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        Мы работаем официально и можем указать в договоре любой вид
                                        оплаты по согласованию сторон. При без нал оплате даем
                                        закрывающие документы (в - расход можно оформить). Не работаем
                                        без предоплаты или по форме - “делай, а потом заплачу”. Но наши
                                        услуги можем оформить рассрочку гражданам РФ.
                                    </div>
                                </div>
                                <div className="foryou-el hidden" ffcoder-foryou-el={8}>
                                    <div className="foryou-el__title font-medium text-[11px] 2xl:text-2xl leading-7">
                                        Результативность
                                    </div>
                                    <div className="foryou-el__content mt-2 2xl:mt-6 text-[11px] 2xl:text-xl">
                                        Для каждой работы есть свой инструмент. Так и для каждой рабочей
                                        схемы развития есть свой набор мнструментов интернет маркетинга.
                                        Важно правильно составить этот набор. Спланировать этапы
                                        развития и реализовать. Для этого и нужны веб студии.
                                    </div>
                                </div>
                            </div>
                            <div className="foryou-nav absolute z-20 w-full bottom-4 2xl:bottom-8 flex justify-between px-12">
                                <a className="foryou-nav__prev" href="#">
                                    <svg
                                        className="w-4 2xl:w-8 h-4 2xl:h-8"
                                        width={30}
                                        height={30}
                                        viewBox="0 0 31 30"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M23.1634 14.6168C23.0583 14.6068 22.9528 14.5962 22.8475 14.5854C22.4148 14.5418 21.9674 14.4969 21.5256 14.491C19.7623 14.4674 17.2665 14.449 14.8527 14.4313C12.983 14.4182 11.2173 14.405 9.86401 14.3898C9.76552 14.3861 9.66734 14.3759 9.5701 14.3594L9.50416 14.3498L9.58919 14.255C9.68498 14.1479 9.76451 14.0592 9.84736 13.9738C11.0167 12.7492 11.9941 11.3454 12.7447 9.81248L12.7685 9.76557C12.8427 9.63276 12.9013 9.49129 12.9428 9.34417C12.9567 9.2569 12.951 9.16751 12.9259 9.08291C12.9185 9.04894 12.911 9.01496 12.9066 8.98164L12.8975 8.91235L12.8307 8.92554C12.7918 8.93254 12.7525 8.93747 12.7131 8.94029C12.6124 8.93797 12.5136 8.96787 12.4303 9.02588C12.3378 9.11552 12.2548 9.21492 12.1826 9.32244C12.1267 9.40339 12.0656 9.48049 11.9999 9.55318C11.4614 10.1194 10.9217 10.6847 10.3809 11.2488C9.68609 11.9747 8.99259 12.7019 8.30036 13.4306C7.99166 13.7359 7.71332 14.0721 7.46948 14.4341C7.12166 14.9894 7.17493 15.4514 7.64633 15.9787C8.09942 16.485 8.5739 17.0336 9.09691 17.6557C9.47769 18.1085 9.85658 18.563 10.2336 19.0191C10.6434 19.5132 11.0548 20.0063 11.4678 20.4984C11.6255 20.6962 11.8104 20.8692 12.0168 21.012C12.0954 21.0555 12.1837 21.077 12.2729 21.0745C12.358 21.0803 12.4424 21.055 12.5112 21.0031C12.5681 20.9331 12.6064 20.8491 12.6224 20.7593C12.6384 20.6695 12.6316 20.577 12.6027 20.4908C12.4909 20.2797 12.3582 20.0811 12.2067 19.8982C12.1736 19.8552 12.1405 19.8123 12.1081 19.7692C11.6327 19.1388 11.1569 18.5089 10.6807 17.8796C10.1257 17.1458 9.57142 16.4118 9.01776 15.6774C8.97215 15.6121 8.93197 15.543 8.89764 15.4707L8.871 15.4194C9.17682 15.4349 9.47785 15.4506 9.77411 15.4664C10.5069 15.5049 11.199 15.5412 11.9007 15.5689C13.3918 15.6273 15.57 15.6844 17.6764 15.7393C19.4897 15.7867 21.2024 15.8315 22.4602 15.8761C22.7067 15.8824 22.9532 15.8645 23.1963 15.8225C23.5677 15.7618 23.7561 15.5653 23.7559 15.2381C23.7551 14.8742 23.5448 14.6531 23.1634 14.6168Z"
                                            fill="white"
                                        />
                                        <path
                                            d="M1.03066 10.8723C-0.295055 16.2303 0.865847 20.9571 4.48352 24.9235C4.57765 25.026 4.67369 25.1285 4.76961 25.2272C6.71298 27.2255 9.13351 28.4593 11.0514 29.3179C11.8746 29.6875 16.0985 30.1365 17.2412 29.9615C24.0328 28.9186 28.5022 24.9795 30.0589 18.3895C30.3561 17.0986 30.5042 15.7762 30.4999 14.4496C30.5071 11.3246 29.2276 7.69161 26.5888 4.97064C26.3172 4.73966 26.0464 4.50037 25.7847 4.2686C25.2169 3.7666 24.6301 3.24708 24.0162 2.80381C19.3264 -0.590347 14.4535 -0.609439 9.5337 1.19049C5.07939 2.81857 2.21871 6.07669 1.03066 10.8723ZM9.55279 2.79433C13.8696 0.949625 18.2008 0.624089 22.4251 3.38693C23.1976 3.89262 25.2567 5.60406 25.581 5.86112L25.6017 5.87694L25.619 5.89655C27.2671 7.69372 29.1542 10.9798 29.1126 14.3577C29.0988 15.8021 28.9086 17.2391 28.5465 18.6347C27.4735 22.6453 24.9081 25.5683 20.7037 27.5675C16.4296 29.672 10.2998 27.5444 8.6689 26.4373C6.86629 25.17 5.28903 23.5934 4.00609 21.7764C1.99396 18.847 1.5424 14.6361 2.62364 10.7867C3.12965 9.00933 4.01395 7.37001 5.21243 5.98763C6.41091 4.60526 7.89354 3.51446 9.55279 2.79433Z"
                                            fill="white"
                                        />
                                    </svg>
                                </a>
                                <a className="foryou-nav__next" href="#">
                                    <svg
                                        className="w-4 2xl:w-8 h-4 2xl:h-8"
                                        width={30}
                                        height={30}
                                        viewBox="0 0 44 44"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M1.02197 16.083C-0.911467 23.7628 0.781601 30.5378 6.05764 36.223C6.19492 36.3699 6.33499 36.5168 6.47488 36.6583C9.3091 39.5225 12.8392 41.2909 15.6363 42.5216C16.8368 43.0514 22.9968 43.6949 24.6636 43.444C34.5685 41.9491 41.0867 36.3033 43.3569 26.8576C43.7904 25.0074 44.0062 23.1119 44 21.2105C44.0106 16.7313 42.1446 11.524 38.2962 7.62394C37.8999 7.29286 37.5051 6.94989 37.1233 6.61749C36.2954 5.89815 35.4396 5.15331 34.5442 4.51815C27.7045 -0.346993 20.598 -0.37417 13.4229 2.20573C6.92648 4.53911 2.75462 9.20927 1.02197 16.083ZM13.4507 4.50456C19.7461 1.86049 26.0628 1.39388 32.2238 5.35395C33.3502 6.07877 36.3534 8.53184 36.8262 8.90029L36.8566 8.92291L36.8816 8.95107C39.2853 11.527 42.0376 16.237 41.9769 21.0787C41.9568 23.1491 41.6794 25.2086 41.1513 27.2091C39.5864 32.9576 35.8451 37.1472 29.7132 40.0127C23.4796 43.0292 14.5401 39.9797 12.1616 38.3928C9.53272 36.5763 7.23239 34.3165 5.36118 31.7122C2.42666 27.5134 1.76829 21.4778 3.34518 15.9603C4.08307 13.4127 5.37274 11.0629 7.12062 9.08153C8.8685 7.10012 11.0308 5.53667 13.4507 4.50456Z"
                                            fill="white"
                                        />
                                        <path
                                            d="M31.4623 18.1923C30.9072 17.5434 30.3547 16.892 29.8047 16.2381C29.2063 15.5299 28.6064 14.8232 28.0049 14.1179C27.7748 13.8341 27.5051 13.5858 27.2042 13.3808C27.0239 13.2666 26.6349 13.2518 26.4836 13.3932C26.4007 13.4937 26.3449 13.6141 26.3215 13.7428C26.2982 13.8715 26.3081 14.0042 26.3503 14.1278C26.513 14.4294 26.706 14.7133 26.9263 14.975C26.9752 15.0371 27.0239 15.0991 27.0718 15.1614C27.7603 16.0588 28.4496 16.9556 29.1396 17.852C29.9532 18.9098 30.7662 19.9679 31.5787 21.0264C31.6453 21.1203 31.704 21.2196 31.7542 21.3233C31.7664 21.3467 31.7793 21.3709 31.7916 21.3962C31.3454 21.3739 30.9071 21.3513 30.4739 21.3288C29.4056 21.2737 28.3963 21.2216 27.3736 21.1819C25.1972 21.098 22.018 21.0163 18.9434 20.9366C16.3017 20.869 13.8063 20.8045 11.9735 20.7408C11.6141 20.7314 11.2545 20.7571 10.9 20.8177C10.3584 20.9047 10.0836 21.1863 10.084 21.6552C10.084 22.1784 10.3908 22.4953 10.9472 22.5474C11.1006 22.5618 11.2541 22.5767 11.4076 22.5922C12.0387 22.6548 12.6915 22.7192 13.336 22.7277C15.9074 22.7615 19.5474 22.7879 23.0667 22.8132C25.7935 22.8321 28.3689 22.8509 30.3423 22.8726C30.4859 22.878 30.6291 22.8925 30.7709 22.9162L30.8675 22.93C30.8243 22.977 30.7838 23.0218 30.7449 23.0642C30.6045 23.2185 30.488 23.3462 30.3666 23.4689C28.6612 25.2242 27.2358 27.2364 26.1413 29.4335L26.1065 29.5007C25.9982 29.6911 25.9128 29.8939 25.8522 30.1047C25.8319 30.2298 25.8404 30.358 25.877 30.4793C25.8878 30.528 25.8985 30.5767 25.905 30.6244L25.9185 30.7237L26.0156 30.7048C26.0725 30.6948 26.1298 30.6877 26.1874 30.6837C26.3342 30.6871 26.4783 30.6441 26.5998 30.5608C26.7346 30.4323 26.8557 30.2899 26.961 30.1359C27.0426 30.0198 27.1316 29.9093 27.2275 29.805C28.006 29.0004 28.7862 28.1974 29.5683 27.396C30.5884 26.3481 31.6066 25.2987 32.6227 24.2475C33.073 23.8101 33.479 23.3283 33.8345 22.8092C34.3417 22.0132 34.264 21.3511 33.5767 20.5951C32.9206 19.8741 32.2286 19.0877 31.4623 18.1923Z"
                                            fill="white"
                                        />
                                    </svg>
                                </a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>

    );
}

export default CareClients;