import axios from "axios";
import Test from "@/components/Test/test";
export const getStaticPaths = async () => {
    const url = 'https://xn----8sbb1agckqokro3icn.xn--p1ai/wp-json/mapbiz/v1/develop';
    const res = await axios.get(url);
    const data = res.data.fields.routes;
    const paths = data.map((item) => ({
        params: {link: item.route},
    }));
    return {
        paths,
        fallback: false,
    };
};

export async function getDate(link) {
    const url = `https://xn----8sbb1agckqokro3icn.xn--p1ai/wp-json/mapbiz/v1/develop/${link}`
    const res = await axios.get(`${url}`)
    const data = res.data

    return {
            data,
    };

}


export default async function Page({params}) {
   const data =  await getDate(params.link).then(res => {
       return res
   })

    return (
        <div className='pt-[200px]'>
            <section>
                <div>
                    <svg
                        className="w-full h-auto"
                        width={1454}
                        height={80}
                        viewBox="0 0 1454 80"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                    >
                        <g filter="url(#filter0_d_460_881)">
                            <path d="M7 73L166 7H1289L1447 73" stroke="white" />
                        </g>
                        <defs>
                            <filter
                                id="filter0_d_460_881"
                                x="0.808105"
                                y="0.5"
                                width="1452.38"
                                height="78.9618"
                                filterUnits="userSpaceOnUse"
                                colorInterpolationFilters="sRGB"
                            >
                                <feFlood floodOpacity={0} result="BackgroundImageFix" />
                                <feColorMatrix
                                    in="SourceAlpha"
                                    type="matrix"
                                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                    result="hardAlpha"
                                />
                                <feOffset />
                                <feGaussianBlur stdDeviation={3} />
                                <feComposite in2="hardAlpha" operator="out" />
                                <feColorMatrix
                                    type="matrix"
                                    values="0 0 0 0 0 0 0 0 0 1 0 0 0 0 0.897059 0 0 0 1 0"
                                />
                                <feBlend
                                    mode="normal"
                                    in2="BackgroundImageFix"
                                    result="effect1_dropShadow_460_881"
                                />
                                <feBlend
                                    mode="normal"
                                    in="SourceGraphic"
                                    in2="effect1_dropShadow_460_881"
                                    result="shape"
                                />
                            </filter>
                        </defs>
                    </svg>
                </div>
                <div className="develop-nav max-w-screen-xl mx-auto grid grid-cols-3 font-grotesk-light text-2xl text-whitetext-mapbiz -mt-16">
                    <div
                        className="develop-nav-el w-full mx-auto flex justify-center items-center gap-x-6 py-4 relative hover:text-neon-mapbiz cursor-pointer select-none"
                        ffcoder-develop-el="develop"
                    >
                        <div className="develop-nav-border__bottom absolute w-[95%] h-0.5 bg-white shadow-neon-mapbiz -bottom-1 left-0 right-0 mx-auto" />
                        <div>
                            <svg
                                width={36}
                                height={36}
                                viewBox="0 0 36 36"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <g clipPath="url(#clip0_238_343)">
                                    <g filter="url(#filter0_d_238_343)">
                                        <path
                                            d="M35.814 19.1374C35.86 22.5064 35.9221 25.8766 35.9436 29.2463C35.9513 30.4768 35.8349 31.7076 35.8232 32.9387C35.8064 34.671 34.1362 35.7152 32.2021 35.7471C28.2791 35.812 24.3549 35.889 20.4309 35.8727C15.7615 35.8532 11.0922 35.7554 6.42391 35.6581C5.33708 35.6145 4.25425 35.5202 3.18075 35.3758C1.87152 35.2251 0.584536 34.0037 0.537485 32.8464C0.418769 29.9208 0.282307 26.9947 0.242623 24.068C0.155218 17.6288 0.138159 11.1895 0.0534333 4.75103C0.0403728 3.76177 0.0715036 2.80373 0.575503 1.88878C0.952749 1.2041 1.49393 0.649972 2.42942 0.445248C2.76099 0.375874 3.10101 0.336558 3.44326 0.328104C4.90269 0.281236 6.36564 0.283492 7.82222 0.205787C13.2937 -0.085066 18.7645 0.137924 24.2359 0.174875C24.76 0.167002 25.2807 0.245558 25.7663 0.405846C26.252 0.566134 26.6924 0.804848 27.061 1.10738C28.804 2.45093 30.6722 3.68749 32.4797 4.97643C33.1465 5.4519 33.7615 5.97639 34.447 6.43216C35.2306 6.95328 35.4684 7.61839 35.4823 8.40197C35.5417 11.7254 35.6246 15.0484 35.6976 18.3716C35.7031 18.627 35.6976 18.8825 35.6976 19.138L35.814 19.1374ZM23.7449 1.91292C23.2491 1.88005 22.8269 1.83293 22.4037 1.82709C18.7954 1.77745 15.1869 1.73247 11.5783 1.69217C9.94704 1.67383 8.31549 1.66636 6.6841 1.65834C5.8551 1.65427 5.02445 1.63286 4.19762 1.66709C3.01565 1.716 2.66851 1.99417 2.45619 2.96536C2.25464 3.83406 2.21324 4.72216 2.33331 5.60075C2.38954 5.96966 2.41887 6.34102 2.4212 6.71274C2.44052 15.0086 2.4565 23.3041 2.46912 31.5993C2.45876 31.8083 2.46827 32.0175 2.49757 32.2253C2.70369 33.285 3.39238 33.9279 4.81731 33.9745C10.3441 34.1555 15.871 34.1547 21.3997 34.0789C24.1776 34.0407 26.956 34.0213 29.7342 33.9954C30.4207 33.9891 31.1087 34.0103 31.7937 33.9839C33.0277 33.9365 33.6039 33.4541 33.5925 32.4412C33.5726 30.6768 33.5165 28.9127 33.4721 27.1485C33.4464 26.1264 33.4246 25.1041 33.3827 24.0824C33.2893 21.8071 33.1398 19.5325 33.0962 17.2567C33.0488 14.7706 33.0962 12.2846 33.0991 9.79774C33.0991 9.61842 33.079 9.43899 33.0678 9.25315C32.9735 9.23237 32.8772 9.21826 32.7799 9.21109C31.0333 9.23934 29.2869 9.28426 27.5402 9.29268C26.9965 9.29614 26.4545 9.24589 25.9257 9.14316C24.8424 8.92934 24.5098 8.59201 24.3837 7.70043C24.3479 7.4468 24.3462 7.1902 24.3168 6.93575C24.1327 5.29673 23.9442 3.65627 23.7449 1.91292ZM31.757 7.36983L31.7925 7.22258L26.1218 3.04827L25.9912 3.11766C26.2696 4.60072 26.5481 6.0838 26.8347 7.61102L31.757 7.36983Z"
                                            fill="white"
                                        />
                                    </g>
                                    <path
                                        d="M27.4635 26.5907C26.5484 25.9169 25.6878 25.2798 24.8223 24.6479C24.5041 24.4152 24.1681 24.198 23.8524 23.963C23.7047 23.8532 23.574 23.7293 23.4628 23.5941C23.1596 23.2233 23.1751 22.8228 23.4836 22.5723C23.653 22.444 23.875 22.3712 24.1068 22.3681C24.3385 22.365 24.5636 22.4317 24.7382 22.5553C25.7057 23.1695 26.6629 23.7957 27.5931 24.4466C28.1766 24.8551 28.7019 25.3183 29.2561 25.7546C30.0324 26.3659 30.0883 26.8821 29.2844 27.4758C27.9951 28.4275 26.644 29.3233 25.3132 30.2383C25.0123 30.4526 24.6933 30.6497 24.3588 30.8282C23.8119 31.1089 23.2202 31.0436 22.899 30.6997C22.5809 30.3585 22.6884 29.888 23.2036 29.5358C24.3191 28.7733 25.45 28.0257 26.5683 27.2661C26.8485 27.0747 27.1048 26.8625 27.4635 26.5907Z"
                                        fill="white"
                                    />
                                    <path
                                        d="M8.39993 26.6529C9.68153 27.2568 10.8659 27.8136 12.0485 28.3726C12.3269 28.4897 12.5942 28.6234 12.8482 28.7727C13.2293 29.0218 13.3209 29.3234 13.1692 29.6348C12.9984 29.9856 12.652 30.1559 12.1409 30.1018C11.9148 30.0781 11.6961 30.0206 11.4956 29.9324C9.89789 29.2124 8.29543 28.4995 6.71947 27.7495C5.89398 27.3567 5.81262 26.7714 6.42563 26.1736C6.55288 26.0496 6.70792 25.9445 6.84874 25.8294C8.25809 24.6782 9.67315 23.5318 11.073 22.373C11.5656 21.9654 11.9723 21.851 12.3174 22.0821C12.6674 22.3165 12.6928 22.6924 12.239 23.1373C11.292 24.0657 10.2915 24.9582 9.30881 25.8623C9.04609 26.1034 8.76764 26.3337 8.39993 26.6529Z"
                                        fill="white"
                                    />
                                    <path
                                        d="M20.2756 21.3659C21.0254 21.2397 21.3127 21.3739 21.3138 21.9127C21.3 22.3296 21.2374 22.7445 21.1271 23.1517C20.7229 24.8646 19.9988 26.4988 19.2263 28.1197C18.9277 28.7461 18.6494 29.3814 18.2901 29.9846C18.0972 30.2871 17.8259 30.5523 17.4949 30.7618C17.2143 30.9445 16.828 30.8975 16.5405 30.7036C16.4008 30.6193 16.2986 30.5003 16.2495 30.3647C16.2003 30.2291 16.2068 30.0843 16.2679 29.952C16.406 29.6482 16.5682 29.3519 16.7535 29.0653C18.0992 26.9368 19.2509 24.7482 19.92 22.4087C20.0037 22.1155 20.0814 21.821 20.1669 21.5281C20.1961 21.4711 20.2324 21.4167 20.2756 21.3659Z"
                                        fill="white"
                                    />
                                </g>
                                <defs>
                                    <filter
                                        id="filter0_d_238_343"
                                        x="-5.94873"
                                        y="-5.9416"
                                        width="47.8926"
                                        height="47.8166"
                                        filterUnits="userSpaceOnUse"
                                        colorInterpolationFilters="sRGB"
                                    >
                                        <feFlood floodOpacity={0} result="BackgroundImageFix" />
                                        <feColorMatrix
                                            in="SourceAlpha"
                                            type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                            result="hardAlpha"
                                        />
                                        <feOffset />
                                        <feGaussianBlur stdDeviation={3} />
                                        <feComposite in2="hardAlpha" operator="out" />
                                        <feColorMatrix
                                            type="matrix"
                                            values="0 0 0 0 0.441862 0 0 0 0 0.945833 0 0 0 0 0.398038 0 0 0 0.45 0"
                                        />
                                        <feBlend
                                            mode="normal"
                                            in2="BackgroundImageFix"
                                            result="effect1_dropShadow_238_343"
                                        />
                                        <feBlend
                                            mode="normal"
                                            in="SourceGraphic"
                                            in2="effect1_dropShadow_238_343"
                                            result="shape"
                                        />
                                    </filter>
                                    <clipPath id="clip0_238_343">
                                        <rect width={36} height={36} fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div>Разработка</div>
                    </div>
                    <div
                        className="develop-nav-el w-full mx-auto flex justify-center items-center gap-x-6 py-4 relative hover:text-neon-mapbiz cursor-pointer select-none"
                        ffcoder-develop-el="design"
                    >
                        <div className="develop-nav-border__right absolute h-full w-0.5 bg-white shadow-neon-mapbiz left-0" />
                        <div className="develop-nav-border__bottom absolute w-[95%] h-0.5 bg-white shadow-neon-mapbiz -bottom-1 left-0 right-0 mx-auto" />
                        <div>
                            <svg
                                width={36}
                                height={36}
                                viewBox="0 0 36 36"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <g clipPath="url(#clip0_240_378)">
                                    <path
                                        d="M35.849 0.914343C35.8066 0.784281 35.7371 0.66532 35.6456 0.565773C35.5541 0.466228 35.4424 0.388495 35.3187 0.338025C35.109 0.247599 34.8852 0.196725 34.6581 0.187767L34.3653 0.176445C33.6636 0.148777 32.9384 0.120471 32.2235 0.135877C28.8799 0.20992 26.3161 1.86968 24.6035 5.06881C24.1599 5.86983 23.9383 6.78102 23.9629 7.70295C23.974 8.03497 23.8518 8.20853 23.5879 8.45267C22.7852 9.1953 21.9557 9.96341 21.1796 10.7636C20.4121 11.5553 19.6418 12.3699 18.8968 13.1577C17.8509 14.2634 16.7696 15.4069 15.6809 16.5037C12.2824 19.9265 8.81126 23.3902 5.45442 26.7401C4.14386 28.0477 2.83362 29.3557 1.52369 30.6641C0.483807 31.7034 0.0248004 32.7587 0.0795631 33.9854C0.0823264 34.3537 0.193724 34.7126 0.398949 35.0143C0.604173 35.3161 0.893519 35.5463 1.22866 35.6747C1.61457 35.8494 2.03118 35.9405 2.45269 35.9427C2.99653 35.9377 3.52985 35.7876 4.00054 35.5068C5.04331 34.9038 6.13488 34.2349 7.0123 33.2773C8.47793 31.6778 10.0134 30.0389 11.5761 28.404C12.9563 26.9603 14.3755 25.5078 15.7481 24.103C19.5115 20.2515 23.4032 16.2683 26.9156 12.033C27.2926 11.5782 27.6105 11.277 28.2691 11.5446L28.3149 11.563L28.3617 11.5512C28.5028 11.5158 28.6551 11.4841 28.8136 11.4509C29.2184 11.3775 29.6164 11.2685 30.0034 11.1253C30.7277 10.8522 31.3795 10.4072 31.9059 9.82634C32.4325 9.24547 32.8189 8.54504 33.0339 7.78171C33.3358 6.79132 33.5514 5.79808 33.7222 4.95719C34.0041 3.57143 34.4817 2.73305 35.3193 2.15375C35.4879 2.0343 35.6305 1.87976 35.7376 1.70005C35.8105 1.58537 35.8584 1.45563 35.8776 1.31991C35.8969 1.18418 35.8871 1.04576 35.849 0.914343ZM1.96028 33.8368C1.91925 33.7834 1.89055 33.721 1.87634 33.6545C1.86212 33.588 1.86275 33.519 1.8782 33.4528C1.88795 33.2075 1.94745 32.9672 2.05289 32.7472C2.15833 32.5273 2.30735 32.3325 2.49034 32.1756C3.26403 31.4814 4.00189 30.722 4.71564 29.9875C5.02576 29.6685 5.33589 29.3496 5.64952 29.0347C9.67115 24.9989 13.6934 20.9639 17.7164 16.9299C17.7548 16.8942 17.7953 16.8607 17.8375 16.8297L17.8699 16.8047L18.7985 18.0195C18.7589 18.0638 18.7209 18.1067 18.684 18.1485C18.5571 18.2916 18.4428 18.4206 18.324 18.545L17.8369 19.0551C14.2643 22.7974 10.6906 26.5389 7.11588 30.2797L7.00364 30.3969C6.02065 31.4259 5.0041 32.49 3.75584 33.2074C3.28868 33.4757 2.7945 33.6909 2.28211 33.8491C2.23095 33.8717 2.17553 33.8824 2.11986 33.8804C2.06418 33.8782 2.00967 33.8634 1.96028 33.8368ZM33.1095 2.01558C32.3826 2.97736 32.0967 4.05923 31.8196 5.10952C31.7407 5.40821 31.6592 5.71652 31.5694 6.01411C31.4173 6.54636 31.2191 7.06338 30.9771 7.55895C30.373 8.7501 29.1787 9.33113 27.8612 9.07551C27.4968 9.00477 27.1338 8.92521 26.7934 8.84959C26.0554 8.68594 25.7661 8.29736 25.8257 7.55017C25.8471 7.1921 25.9268 6.84029 26.0614 6.50945C27.2103 3.86447 28.9502 2.39979 31.3805 2.03193C31.6083 1.99969 31.8382 1.98477 32.0682 1.9873C32.2636 1.9873 32.4671 1.9945 32.684 2.00299C32.8225 2.00723 32.9641 2.01212 33.1098 2.01558H33.1095ZM25.7395 10.6689L20.419 16.377L19.3896 15.1821L24.5105 9.60342L25.7395 10.6689Z"
                                        fill="white"
                                        fillOpacity="0.8"
                                    />
                                </g>
                                <defs>
                                    <clipPath id="clip0_240_378">
                                        <rect width={36} height={36} fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div>Дизайн</div>
                    </div>
                    <div
                        className="develop-nav-el w-full mx-auto flex justify-center items-center gap-x-6 py-4 relative hover:text-neon-mapbiz cursor-pointer select-none"
                        ffcoder-develop-el="market"
                    >
                        <div className="develop-nav-border__right absolute h-full w-0.5 bg-white shadow-neon-mapbiz left-0" />
                        <div className="develop-nav-border__bottom absolute w-[95%] h-0.5 bg-white shadow-neon-mapbiz -bottom-1 left-0 right-0 mx-auto" />
                        <div>
                            <svg
                                width={38}
                                height={36}
                                viewBox="0 0 38 36"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <g clipPath="url(#clip0_460_843)">
                                    <path
                                        d="M34.4813 3.04029C33.1481 3.22222 32.0407 3.36442 30.9366 3.52722C30.192 3.63699 29.4532 3.78441 28.7089 3.89691C28.4467 3.94937 28.1775 3.95647 27.913 3.91793C27.5845 3.85108 27.2945 3.63427 27.3003 3.27154C27.2982 3.01192 27.3908 2.76041 27.5611 2.56348C27.8075 2.35841 28.0978 2.21184 28.4099 2.13486C28.9768 1.97093 29.5599 1.8616 30.1365 1.73174C31.9709 1.31645 33.8052 0.901122 35.6397 0.485729C37.0507 0.1643 37.8694 0.685945 37.9561 2.11774C38.0334 3.39574 37.9736 4.68345 37.9387 5.96595C37.9037 7.24845 37.8345 8.52902 37.7593 9.80943C37.7223 10.1463 37.6652 10.4807 37.5884 10.8108C37.1382 10.9094 36.9623 10.6984 36.8874 10.4353C36.6832 9.71671 36.5031 8.9909 36.333 8.26334C36.1874 7.64347 36.0702 7.01733 35.9064 6.23079C35.5713 6.5744 35.2885 6.7994 35.0864 7.08145C33.1516 9.78322 31.2361 12.4985 29.303 15.2014C28.3987 16.4657 27.4788 17.7189 26.5435 18.9609C26.1996 19.4395 25.8078 19.8823 25.3741 20.2823C24.6527 20.9163 23.8392 20.9413 22.9959 20.3969C22.5464 20.1068 22.1434 19.7457 21.7185 19.4166C20.4475 18.4338 19.1582 17.4783 17.6627 16.687C17.3868 16.9366 17.1248 17.201 16.8782 17.479C14.7421 20.1642 12.6117 22.8539 10.4869 25.548C9.55456 26.7246 8.6306 27.9085 7.66799 29.0604C7.32464 29.4696 6.92624 29.8297 6.484 30.1307C5.94101 30.4994 5.66644 30.3707 5.03467 29.5711C5.14353 29.2928 5.27567 29.0241 5.42971 28.7676C8.67054 24.1679 11.9182 19.5729 15.1727 14.9827C16.5463 13.0498 17.2911 12.8613 19.352 14.0009C20.572 14.6759 21.7241 15.4714 22.9036 16.2177C23.2173 16.4163 23.519 16.6335 23.9023 16.8938L34.4813 3.04029Z"
                                        fill="white"
                                        fillOpacity="0.8"
                                    />
                                    <path
                                        d="M35.8407 35.3578C35.8224 35.2908 35.8108 35.2219 35.7999 35.1584C35.7713 34.9919 35.7443 34.8345 35.6109 34.7703C35.2649 34.6067 34.9039 34.476 34.5331 34.3802C32.0853 33.728 29.5366 33.585 27.135 33.4944C26.6563 33.4764 26.1778 33.4579 25.6992 33.4391C21.4557 33.2732 17.0674 33.1016 12.7424 33.3682C10.2118 33.5241 7.63668 33.6555 5.14647 33.7827C4.45277 33.8182 3.75911 33.8539 3.06553 33.8894C2.89925 33.8939 2.73287 33.8852 2.56797 33.8637L2.4378 33.8508C2.42648 33.809 2.415 33.7697 2.40416 33.7327C2.37323 33.6493 2.35593 33.5614 2.3529 33.4725C2.4399 32.346 2.52997 31.2196 2.62311 30.0935C2.7633 28.37 2.90835 26.5877 3.03351 24.833C3.48433 18.5143 3.5241 12.944 3.15525 7.80371C2.97916 5.49779 2.57534 3.21467 1.94962 0.987322C1.88182 0.780459 1.78375 0.584609 1.65854 0.406146C1.611 0.330931 1.56412 0.256746 1.52321 0.182496L1.45707 0.0617247L1.32691 0.108024C0.691582 0.333827 0.694002 0.805741 0.696266 1.15031V1.22565C0.687211 3.79516 0.680744 6.36448 0.676864 8.93366C0.675732 9.55305 0.678962 10.1724 0.682035 10.7918C0.688341 12.0244 0.694813 13.299 0.665868 14.5505C0.581621 18.2501 0.470857 21.8218 0.334865 26.1058C0.271316 28.1059 0.188038 30.1558 0.0872979 32.1985C0.0455788 33.0448 0.0505799 34.1607 0.463405 35.2879L0.479572 35.3313L0.516444 35.3598C1.30151 35.9665 2.09531 35.969 2.73355 35.9658C3.55705 35.9658 4.38065 35.9639 5.20436 35.96C6.1584 35.9573 7.11245 35.9552 8.06649 35.9542C14.1717 35.9557 20.2768 35.9589 26.3821 35.9636H27.4593C27.957 35.9636 28.4551 35.9657 28.9535 35.97C29.4709 35.973 29.9974 35.9763 30.526 35.9763C31.0666 35.9763 31.6094 35.9729 32.1484 35.9628C33.3472 35.9305 34.5411 35.7947 35.7163 35.5565L35.8871 35.5243L35.8407 35.3578Z"
                                        fill="white"
                                        fillOpacity="0.8"
                                    />
                                </g>
                                <defs>
                                    <clipPath id="clip0_460_843">
                                        <rect width={38} height={36} fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div>Маркетинг</div>
                    </div>
                </div>
                <div
                    className="foryou foryou-develop max-w-screen-xl mx-auto pt-28 pb-40 font-grotesk-light hidden"
                    ffcoder-develop-el="develop"
                >
                    <div className="w-full flex justify-end">
                        <div className="w-11/12 grid gap-y-24">
                            <h2 className="text-6xl leading-[5.5rem] text-white opacity-90">
                                Создание сайтов
                            </h2>
                            <div className="foryou-grid grid grid-cols-2">
                                <div className="">
                                    <div className="w-[85%] text-2xl leading-9 text-white opacity-90">
                                        Создаем веб сайты и сервисы различного направления и функционала.
                                        От одностраничных сайтов до онлайн сервисов с бекэндом.
                                    </div>
                                    <div className="foryou-nav mt-6 flex flex-wrap gap-x-4 gap-y-4 text-xs text-grey-mapbiz uppercase">
                                        <a
                                            href="#"
                                            ffcoder-foryou-el={1}
                                            className="foryou-nav__el px-4 py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                                        >
                                            Корпоративный сайт
                                        </a>
                                        <a
                                            href="#"
                                            ffcoder-foryou-el={2}
                                            className="foryou-nav__el px-4 py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                                        >
                                            Интернет магазин
                                        </a>
                                        <a
                                            href="#"
                                            ffcoder-foryou-el={3}
                                            className="foryou-nav__el px-4 py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                                        >
                                            Лендинг
                                        </a>
                                        <a
                                            href="#"
                                            ffcoder-foryou-el={4}
                                            className="foryou-nav__el px-4 py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                                        >
                                            Для агентств недвижимости
                                        </a>
                                        <a
                                            href="#"
                                            ffcoder-foryou-el={5}
                                            className="foryou-nav__el px-4 py-2 border border-greytransparent-mapbiz rounded-[24px] hover:bg-white hover:shadow-white-mapbiz transition duration-300"
                                        >
                                            Для отелей
                                        </a>
                                    </div>
                                </div>
                                <div className="foryou-toggle flex justify-end h-[530px]">
                                    <div
                                        className="foryou-toggle__base w-[90%] h-full bg-center bg-cover bg-no-repeat"
                                        style={{
                                            backgroundImage: "url(assets/images/develop/develop-fone.png)"
                                        }}
                                    />
                                    <div className="foryou-toggle__active w-[90%] h-full hidden bg-center bg-cover bg-no-repeat relative">
                                        <img
                                            className="w-full h-full absolute left-0 top-0"
                                            src="assets/images/home/home-foryou-fone.png"
                                            alt=""
                                        />
                                        <div className="foryou-toggle__close absolute top-6 right-6 cursor-pointer z-20">
                                            <svg
                                                width={30}
                                                height={30}
                                                viewBox="0 0 30 30"
                                                fill="none"
                                                xmlns="http://www.w3.org/2000/svg"
                                            >
                                                <path
                                                    d="M14.3226 17.9674C11.7133 20.3402 9.16172 22.6385 6.63565 24.9654C5.17224 26.3134 3.76123 27.7199 2.30123 29.0716C1.91237 29.4408 1.46552 29.7409 0.979126 29.9595C0.739275 30.0618 0.221335 29.9595 0.103217 29.7722C-0.0530674 29.5234 -0.00686019 29.082 0.0779113 28.7574C0.139582 28.5207 0.390682 28.3248 0.580112 28.1348C4.18256 24.5318 7.78667 20.9312 11.3923 17.3329C11.7969 16.9293 12.2131 16.538 12.6779 16.0898C11.1022 14.316 9.52409 12.6043 8.01749 10.829C5.61295 7.99437 3.25666 5.11755 0.880452 2.25835C0.794073 2.15444 0.71977 2.04071 0.632588 1.9368C0.216766 1.43749 -0.0763915 0.899327 0.397083 0.293654C0.751637 -0.159833 1.59922 -0.0921009 2.18941 0.524822C3.65925 2.06079 5.09106 3.63397 6.51089 5.21923C9.10345 8.11218 11.6758 11.024 14.2591 13.9255C14.3697 14.031 14.4873 14.1287 14.611 14.2178C16.6086 12.2784 18.584 10.3454 20.5759 8.42901C22.8861 6.2076 25.2043 3.99493 27.5306 1.79097C28.4033 0.962547 29.103 0.813227 29.6385 1.29658C30.1935 1.79732 30.1418 2.6339 29.2568 3.53085C26.8639 5.9562 24.4132 8.32265 21.9648 10.6917C20.0997 12.4971 18.2047 14.2714 16.2196 16.1571C17.8327 17.8518 19.3755 19.541 20.993 21.152C22.5466 22.6994 24.187 24.1571 25.7712 25.6726C26.3905 26.2429 26.9704 26.856 27.5069 27.5076C27.9396 28.0543 28.0035 28.733 27.4716 29.2722C26.9475 29.8041 26.3406 29.6161 25.835 29.2136C24.8679 28.4836 23.9408 27.7001 23.058 26.8667C20.3556 24.1783 17.7008 21.4406 15.0287 18.7207C14.8174 18.506 14.6154 18.2806 14.3226 17.9674Z"
                                                    fill="white"
                                                    fillOpacity="0.8"
                                                />
                                            </svg>
                                        </div>
                                        <div className="foryou-els relative z-10 px-9 py-20 text-white opacity-90">
                                            <div className="foryou-el" ffcoder-foryou-el={1}>
                                                <div className="foryou-el__title font-grotesk-medium text-2xl leading-7">
                                                    Корпоративный
                                                </div>
                                                <div className="foryou-el__content mt-6 font-grotesk-light text-xl">
                                                    <p>
                                                        Так называют многостраничный сайт со статичными
                                                        страницами.
                                                    </p>
                                                    <p>
                                                        В нашей компетенции разработка сайтов для компаний
                                                        совершенно разного уровня и типа.
                                                    </p>
                                                    <p>
                                                        Все успешные веб-студии знают “секретный состав работ” для
                                                        создания сайта - лидера ниши.
                                                    </p>
                                                </div>
                                            </div>
                                            <div className="foryou-el hidden" ffcoder-foryou-el={2}>
                                                <div className="foryou-el__title font-grotesk-medium text-2xl leading-7">
                                                    Магазин / каталог
                                                </div>
                                                <div className="foryou-el__content mt-6 font-grotesk-light text-xl">
                                                    <p>
                                                        От того как собран E-comerce сайт зависит не только
                                                        продажи и перспиктивы, но и удобства его
                                                        администрирования.
                                                    </p>
                                                    <p>
                                                        Перспективы роста в поисковых выдачах и возможность
                                                        развиваться с течением времени, внедрять новый функционал.
                                                    </p>
                                                    <p>
                                                        Выполняя разные задачи клиентов мы научились делать
                                                        реально современные сайты
                                                    </p>
                                                </div>
                                            </div>
                                            <div className="foryou-el hidden" ffcoder-foryou-el={3}>
                                                <div className="foryou-el__title font-grotesk-medium text-2xl leading-7">
                                                    Одностраничный сайт
                                                </div>
                                                <div className="foryou-el__content mt-6 font-grotesk-light text-xl">
                                                    <p>
                                                        Сайт, который имеет четкую цель, его логика, содержание и
                                                        дизайн соответствуют целевой аудитории и задаче.
                                                    </p>
                                                    <p>
                                                        Все успешные веб студии знают “секретный состав работ” для
                                                        создания сайта - лидера ниши.
                                                    </p>
                                                </div>
                                            </div>
                                            <div className="foryou-el hidden" ffcoder-foryou-el={4}>
                                                <div className="foryou-el__title font-grotesk-medium text-2xl leading-7">
                                                    Для агентств недвижимости
                                                </div>
                                                <div className="foryou-el__content mt-6 font-grotesk-light text-xl">
                                                    <p>
                                                        Разработка требует понимания специфических потребностей
                                                        агентств - облегчение их рабочих процессов и контроля.
                                                    </p>
                                                    <p>
                                                        Наши решения помогут вам развивать продажи в сети.
                                                        Экспертность приобретена из опыта партнерских отношений с
                                                        агенствами недвижимости
                                                    </p>
                                                </div>
                                            </div>
                                            <div className="foryou-el hidden" ffcoder-foryou-el={5}>
                                                <div className="foryou-el__title font-grotesk-medium text-2xl leading-7">
                                                    Для гостиниц и отелей
                                                </div>
                                                <div className="foryou-el__content mt-6 font-grotesk-light text-xl">
                                                    <p>Вызвать эмоции и выделиться среди конкурентов.</p>
                                                    <p>Легко оформить и оплатить бронь.</p>
                                                    <p>
                                                        Удобно управлять бронированием, легко продвигаться в
                                                        поиске.
                                                    </p>
                                                    <p>
                                                        Это на словах все просто а по факту удается далеко не
                                                        каждому реализовать.
                                                    </p>
                                                    <p>Оцените наши успешные кейсы и решения.</p>
                                                </div>
                                            </div>
                                        </div>
                                        <div className="foryou-nav absolute z-20 w-full bottom-8 flex justify-end px-6 text-whitelink-mapbiz font-grotesk-medium text-lg">
                                            <a
                                                className="foryou-nav-more hidden"
                                                href="#"
                                                ffcoder-foryou-el={1}
                                            >
                                                <div className="flex items-center gap-4">
                                                    <span>смотреть состав работ</span>
                                                    <svg
                                                        width={41}
                                                        height={20}
                                                        viewBox="0 0 41 20"
                                                        fill="none"
                                                        xmlns="http://www.w3.org/2000/svg"
                                                    >
                                                        <path
                                                            d="M18.7324 9.93514C13.8433 9.90013 8.95418 9.87207 4.06505 9.82476C3.09057 9.81514 2.11468 9.74748 1.14412 9.66311C0.983558 9.64768 0.831987 9.58974 0.70925 9.49689C0.586513 9.40404 0.498316 9.2806 0.456192 9.1427C0.376487 8.92192 0.653585 8.60874 0.984532 8.56269C1.30549 8.51806 1.62483 8.44882 1.9474 8.43164C4.00743 8.32125 6.0673 8.16498 8.1293 8.13202C12.3656 8.06469 16.6032 8.04765 20.8404 8.0434C24.8605 8.0393 28.8807 8.08376 32.9007 8.09196C33.5462 8.09338 34.1921 8.02147 34.8365 7.97053C34.8792 7.96121 34.9186 7.94252 34.9511 7.91621C34.9836 7.8899 35.008 7.8568 35.0223 7.81994C35.0339 7.73194 35.0044 7.58338 34.9383 7.55184C33.7029 6.95795 32.4828 6.33315 31.2125 5.80313C28.2573 4.57009 25.4851 3.05808 22.7148 1.54103C22.2596 1.29171 21.7824 1.03845 21.5988 0.543749C21.5654 0.453703 21.5134 0.299476 21.5558 0.269356C21.7078 0.144017 21.8925 0.0539037 22.0934 0.00709057C22.3074 -0.0152477 22.5242 0.0154373 22.7197 0.0957187C23.4119 0.372952 24.0991 0.662338 24.7726 0.973318C29.586 3.19591 34.398 5.42098 39.2085 7.64852C41.0255 8.48432 41.8889 9.29473 39.7078 11.1324C39.0794 11.6621 38.4437 12.191 37.7604 12.6621C34.5915 14.8488 31.4109 17.0222 28.2188 19.1822C27.7799 19.4608 27.3171 19.7086 26.8346 19.9234C26.5198 20.0745 26.2048 19.9849 25.933 19.8037C25.634 19.6042 25.4484 19.0244 25.5514 18.7694C25.7805 18.2032 26.237 17.7879 26.7272 17.4118C28.6147 15.9638 30.5122 14.5262 32.4198 13.099C33.6594 12.1664 34.9121 11.2475 36.1497 10.313C36.2109 10.2669 36.2139 10.1237 36.1892 10.0376C36.1729 10.0004 36.1466 9.96717 36.1127 9.94086C36.0787 9.91454 36.038 9.89591 35.9941 9.88657C35.3472 9.84904 34.6992 9.80126 34.0517 9.80426C28.9451 9.82812 23.8385 9.85786 18.7319 9.8935L18.7324 9.93514Z"
                                                            fill="white"
                                                            fillOpacity="0.8"
                                                        />
                                                    </svg>
                                                </div>
                                            </a>
                                            <a
                                                className="foryou-nav-more flex items-center gap-4 hidden"
                                                href="#"
                                                ffcoder-foryou-el={2}
                                            >
                                                <div className="flex items-center gap-4">
                                                    <span>смотреть состав работ</span>
                                                    <svg
                                                        width={41}
                                                        height={20}
                                                        viewBox="0 0 41 20"
                                                        fill="none"
                                                        xmlns="http://www.w3.org/2000/svg"
                                                    >
                                                        <path
                                                            d="M18.7324 9.93514C13.8433 9.90013 8.95418 9.87207 4.06505 9.82476C3.09057 9.81514 2.11468 9.74748 1.14412 9.66311C0.983558 9.64768 0.831987 9.58974 0.70925 9.49689C0.586513 9.40404 0.498316 9.2806 0.456192 9.1427C0.376487 8.92192 0.653585 8.60874 0.984532 8.56269C1.30549 8.51806 1.62483 8.44882 1.9474 8.43164C4.00743 8.32125 6.0673 8.16498 8.1293 8.13202C12.3656 8.06469 16.6032 8.04765 20.8404 8.0434C24.8605 8.0393 28.8807 8.08376 32.9007 8.09196C33.5462 8.09338 34.1921 8.02147 34.8365 7.97053C34.8792 7.96121 34.9186 7.94252 34.9511 7.91621C34.9836 7.8899 35.008 7.8568 35.0223 7.81994C35.0339 7.73194 35.0044 7.58338 34.9383 7.55184C33.7029 6.95795 32.4828 6.33315 31.2125 5.80313C28.2573 4.57009 25.4851 3.05808 22.7148 1.54103C22.2596 1.29171 21.7824 1.03845 21.5988 0.543749C21.5654 0.453703 21.5134 0.299476 21.5558 0.269356C21.7078 0.144017 21.8925 0.0539037 22.0934 0.00709057C22.3074 -0.0152477 22.5242 0.0154373 22.7197 0.0957187C23.4119 0.372952 24.0991 0.662338 24.7726 0.973318C29.586 3.19591 34.398 5.42098 39.2085 7.64852C41.0255 8.48432 41.8889 9.29473 39.7078 11.1324C39.0794 11.6621 38.4437 12.191 37.7604 12.6621C34.5915 14.8488 31.4109 17.0222 28.2188 19.1822C27.7799 19.4608 27.3171 19.7086 26.8346 19.9234C26.5198 20.0745 26.2048 19.9849 25.933 19.8037C25.634 19.6042 25.4484 19.0244 25.5514 18.7694C25.7805 18.2032 26.237 17.7879 26.7272 17.4118C28.6147 15.9638 30.5122 14.5262 32.4198 13.099C33.6594 12.1664 34.9121 11.2475 36.1497 10.313C36.2109 10.2669 36.2139 10.1237 36.1892 10.0376C36.1729 10.0004 36.1466 9.96717 36.1127 9.94086C36.0787 9.91454 36.038 9.89591 35.9941 9.88657C35.3472 9.84904 34.6992 9.80126 34.0517 9.80426C28.9451 9.82812 23.8385 9.85786 18.7319 9.8935L18.7324 9.93514Z"
                                                            fill="white"
                                                            fillOpacity="0.8"
                                                        />
                                                    </svg>
                                                </div>
                                            </a>
                                            <a
                                                className="foryou-nav-more flex items-center gap-4 hidden"
                                                href="#"
                                                ffcoder-foryou-el={3}
                                            >
                                                <div className="flex items-center gap-4">
                                                    <span>смотреть состав работ</span>
                                                    <svg
                                                        width={41}
                                                        height={20}
                                                        viewBox="0 0 41 20"
                                                        fill="none"
                                                        xmlns="http://www.w3.org/2000/svg"
                                                    >
                                                        <path
                                                            d="M18.7324 9.93514C13.8433 9.90013 8.95418 9.87207 4.06505 9.82476C3.09057 9.81514 2.11468 9.74748 1.14412 9.66311C0.983558 9.64768 0.831987 9.58974 0.70925 9.49689C0.586513 9.40404 0.498316 9.2806 0.456192 9.1427C0.376487 8.92192 0.653585 8.60874 0.984532 8.56269C1.30549 8.51806 1.62483 8.44882 1.9474 8.43164C4.00743 8.32125 6.0673 8.16498 8.1293 8.13202C12.3656 8.06469 16.6032 8.04765 20.8404 8.0434C24.8605 8.0393 28.8807 8.08376 32.9007 8.09196C33.5462 8.09338 34.1921 8.02147 34.8365 7.97053C34.8792 7.96121 34.9186 7.94252 34.9511 7.91621C34.9836 7.8899 35.008 7.8568 35.0223 7.81994C35.0339 7.73194 35.0044 7.58338 34.9383 7.55184C33.7029 6.95795 32.4828 6.33315 31.2125 5.80313C28.2573 4.57009 25.4851 3.05808 22.7148 1.54103C22.2596 1.29171 21.7824 1.03845 21.5988 0.543749C21.5654 0.453703 21.5134 0.299476 21.5558 0.269356C21.7078 0.144017 21.8925 0.0539037 22.0934 0.00709057C22.3074 -0.0152477 22.5242 0.0154373 22.7197 0.0957187C23.4119 0.372952 24.0991 0.662338 24.7726 0.973318C29.586 3.19591 34.398 5.42098 39.2085 7.64852C41.0255 8.48432 41.8889 9.29473 39.7078 11.1324C39.0794 11.6621 38.4437 12.191 37.7604 12.6621C34.5915 14.8488 31.4109 17.0222 28.2188 19.1822C27.7799 19.4608 27.3171 19.7086 26.8346 19.9234C26.5198 20.0745 26.2048 19.9849 25.933 19.8037C25.634 19.6042 25.4484 19.0244 25.5514 18.7694C25.7805 18.2032 26.237 17.7879 26.7272 17.4118C28.6147 15.9638 30.5122 14.5262 32.4198 13.099C33.6594 12.1664 34.9121 11.2475 36.1497 10.313C36.2109 10.2669 36.2139 10.1237 36.1892 10.0376C36.1729 10.0004 36.1466 9.96717 36.1127 9.94086C36.0787 9.91454 36.038 9.89591 35.9941 9.88657C35.3472 9.84904 34.6992 9.80126 34.0517 9.80426C28.9451 9.82812 23.8385 9.85786 18.7319 9.8935L18.7324 9.93514Z"
                                                            fill="white"
                                                            fillOpacity="0.8"
                                                        />
                                                    </svg>
                                                </div>
                                            </a>
                                            <a
                                                className="foryou-nav-more flex items-center gap-4 hidden"
                                                href="#"
                                                ffcoder-foryou-el={4}
                                            >
                                                <div className="flex items-center gap-4">
                                                    <span>смотреть состав работ</span>
                                                    <svg
                                                        width={41}
                                                        height={20}
                                                        viewBox="0 0 41 20"
                                                        fill="none"
                                                        xmlns="http://www.w3.org/2000/svg"
                                                    >
                                                        <path
                                                            d="M18.7324 9.93514C13.8433 9.90013 8.95418 9.87207 4.06505 9.82476C3.09057 9.81514 2.11468 9.74748 1.14412 9.66311C0.983558 9.64768 0.831987 9.58974 0.70925 9.49689C0.586513 9.40404 0.498316 9.2806 0.456192 9.1427C0.376487 8.92192 0.653585 8.60874 0.984532 8.56269C1.30549 8.51806 1.62483 8.44882 1.9474 8.43164C4.00743 8.32125 6.0673 8.16498 8.1293 8.13202C12.3656 8.06469 16.6032 8.04765 20.8404 8.0434C24.8605 8.0393 28.8807 8.08376 32.9007 8.09196C33.5462 8.09338 34.1921 8.02147 34.8365 7.97053C34.8792 7.96121 34.9186 7.94252 34.9511 7.91621C34.9836 7.8899 35.008 7.8568 35.0223 7.81994C35.0339 7.73194 35.0044 7.58338 34.9383 7.55184C33.7029 6.95795 32.4828 6.33315 31.2125 5.80313C28.2573 4.57009 25.4851 3.05808 22.7148 1.54103C22.2596 1.29171 21.7824 1.03845 21.5988 0.543749C21.5654 0.453703 21.5134 0.299476 21.5558 0.269356C21.7078 0.144017 21.8925 0.0539037 22.0934 0.00709057C22.3074 -0.0152477 22.5242 0.0154373 22.7197 0.0957187C23.4119 0.372952 24.0991 0.662338 24.7726 0.973318C29.586 3.19591 34.398 5.42098 39.2085 7.64852C41.0255 8.48432 41.8889 9.29473 39.7078 11.1324C39.0794 11.6621 38.4437 12.191 37.7604 12.6621C34.5915 14.8488 31.4109 17.0222 28.2188 19.1822C27.7799 19.4608 27.3171 19.7086 26.8346 19.9234C26.5198 20.0745 26.2048 19.9849 25.933 19.8037C25.634 19.6042 25.4484 19.0244 25.5514 18.7694C25.7805 18.2032 26.237 17.7879 26.7272 17.4118C28.6147 15.9638 30.5122 14.5262 32.4198 13.099C33.6594 12.1664 34.9121 11.2475 36.1497 10.313C36.2109 10.2669 36.2139 10.1237 36.1892 10.0376C36.1729 10.0004 36.1466 9.96717 36.1127 9.94086C36.0787 9.91454 36.038 9.89591 35.9941 9.88657C35.3472 9.84904 34.6992 9.80126 34.0517 9.80426C28.9451 9.82812 23.8385 9.85786 18.7319 9.8935L18.7324 9.93514Z"
                                                            fill="white"
                                                            fillOpacity="0.8"
                                                        />
                                                    </svg>
                                                </div>
                                            </a>
                                            <a
                                                className="foryou-nav-more flex items-center gap-4 hidden"
                                                href="#"
                                                ffcoder-foryou-el={5}
                                            >
                                                <div className="flex items-center gap-4">
                                                    <span>смотреть состав работ</span>
                                                    <svg
                                                        width={41}
                                                        height={20}
                                                        viewBox="0 0 41 20"
                                                        fill="none"
                                                        xmlns="http://www.w3.org/2000/svg"
                                                    >
                                                        <path
                                                            d="M18.7324 9.93514C13.8433 9.90013 8.95418 9.87207 4.06505 9.82476C3.09057 9.81514 2.11468 9.74748 1.14412 9.66311C0.983558 9.64768 0.831987 9.58974 0.70925 9.49689C0.586513 9.40404 0.498316 9.2806 0.456192 9.1427C0.376487 8.92192 0.653585 8.60874 0.984532 8.56269C1.30549 8.51806 1.62483 8.44882 1.9474 8.43164C4.00743 8.32125 6.0673 8.16498 8.1293 8.13202C12.3656 8.06469 16.6032 8.04765 20.8404 8.0434C24.8605 8.0393 28.8807 8.08376 32.9007 8.09196C33.5462 8.09338 34.1921 8.02147 34.8365 7.97053C34.8792 7.96121 34.9186 7.94252 34.9511 7.91621C34.9836 7.8899 35.008 7.8568 35.0223 7.81994C35.0339 7.73194 35.0044 7.58338 34.9383 7.55184C33.7029 6.95795 32.4828 6.33315 31.2125 5.80313C28.2573 4.57009 25.4851 3.05808 22.7148 1.54103C22.2596 1.29171 21.7824 1.03845 21.5988 0.543749C21.5654 0.453703 21.5134 0.299476 21.5558 0.269356C21.7078 0.144017 21.8925 0.0539037 22.0934 0.00709057C22.3074 -0.0152477 22.5242 0.0154373 22.7197 0.0957187C23.4119 0.372952 24.0991 0.662338 24.7726 0.973318C29.586 3.19591 34.398 5.42098 39.2085 7.64852C41.0255 8.48432 41.8889 9.29473 39.7078 11.1324C39.0794 11.6621 38.4437 12.191 37.7604 12.6621C34.5915 14.8488 31.4109 17.0222 28.2188 19.1822C27.7799 19.4608 27.3171 19.7086 26.8346 19.9234C26.5198 20.0745 26.2048 19.9849 25.933 19.8037C25.634 19.6042 25.4484 19.0244 25.5514 18.7694C25.7805 18.2032 26.237 17.7879 26.7272 17.4118C28.6147 15.9638 30.5122 14.5262 32.4198 13.099C33.6594 12.1664 34.9121 11.2475 36.1497 10.313C36.2109 10.2669 36.2139 10.1237 36.1892 10.0376C36.1729 10.0004 36.1466 9.96717 36.1127 9.94086C36.0787 9.91454 36.038 9.89591 35.9941 9.88657C35.3472 9.84904 34.6992 9.80126 34.0517 9.80426C28.9451 9.82812 23.8385 9.85786 18.7319 9.8935L18.7324 9.93514Z"
                                                            fill="white"
                                                            fillOpacity="0.8"
                                                        />
                                                    </svg>
                                                </div>
                                            </a>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </section>
            <Test data={data}></Test>
        </div>
    )
}